// Пропись числа.
// 
// Параметры:
//  ЗначениеЧисла - Число
//  Валюта - СправочникСсылка.Валюты
// 
// Возвращаемое значение:
//  Строка - Пропись числа
Функция ПрописьЧисла(ЗначениеЧисла, Валюта) Экспорт
	ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла);
	
	ВалютаЕвро				= Справочники.Валюты.НайтиПоНаименованию("EUR", Истина);
	ВалютаДолллар			= Справочники.Валюты.НайтиПоНаименованию("USD", Истина);
	ВалютаБелорусскийРубль	= Справочники.Валюты.НайтиПоНаименованию("BYN", Истина);
	
	Если Валюта = ВалютаЕвро Тогда
		ФормСтрока = "L=pl_PL; ДП = Истина";
		ПарПредмета="Euro, Euro, Euro, М, cent, cent, cent, M, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);
	ИначеЕсли Валюта = ВалютаДолллар Тогда
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="доллар, доллара, долларов, м, цент, цента, центов, м, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);
	ИначеЕсли Валюта = ВалютаБелорусскийРубль Тогда
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета = "белорусский рубль, белорусского рубля, белорусских рублей, м, копейка, копейки, копеек, ж, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);	
	КонецЕсли;
	Возврат ЗначениеЧислаПописью;
КонецФункции

Функция КурсВалюты(Валюта, ДатаКурса) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Валюта", Валюта);
	Структура.Вставить("Курс", 0);
	Структура.Вставить("Кратность", 1);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", Новый Граница(КонецДня(ДатаКурса), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	Возврат Структура;
КонецФункции

Функция КроссКурс(ВалютаИсточник, ВалютаВКоторуюКонвертируем, ДатаКонвертации) Экспорт
	СтруктураКурсаИсточник = КурсВалюты(ВалютаИсточник, ДатаКонвертации);
	СтруктураКурсаВКоторуюКОнвертируем = КурсВалюты(ВалютаВКоторуюКонвертируем, ДатаКонвертации);
	
	КурсКонвертации = СтруктураКурсаВКоторуюКОнвертируем.Курс / СтруктураКурсаИсточник.Курс;
	
	Возврат КурсКонвертации;
КонецФункции