
&НаСервере
Процедура ПоискПоШКНаСервере(ВходящийШК)
    Результат.Очистить();
    
    
    перСервер = "http://192.168.122.3:8080/Retail/hs/Retail1C_API/winestyleex";
    перСервер = "192.168.122.3";
    
    перПорт = 8080;
    перПользователь = "ws_exchange";
    перПароль       = "qs2lEVnC9z";
    
    перРесурсНаСервере = "/Retail/hs/Retail1C_API/winestyleex/";
    перРесурсНаСервереФин = перРесурсНаСервере + "GetExciseStampInfo?ExciseStamp="+СокрЛП(ВходящийШК);	
    
    Если перПорт <= 0 Тогда 
        HTTPСоединение = Новый HTTPСоединение(перСервер,,перПользователь,перПароль);
    Иначе 
        HTTPСоединение = Новый HTTPСоединение(перСервер,перПорт,перПользователь,перПароль);
    КонецЕсли;
    
    HTTPЗапрос= Новый HTTPЗапрос(перРесурсНаСервереФин);
    HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
    
    Если HTTPОтвет.КодСостояния = 200 Тогда 
        ОтветСтрока = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);	
        ЧтениеJSON = Новый ЧтениеJSON;
        ЧтениеJSON.УстановитьСтроку(ОтветСтрока);
        Попытка
            СтруктураJSON = ПрочитатьJSON(ЧтениеJSON,Ложь);	
            ВывестиИнформациюОбАМ(СтруктураJSON);
        Исключение
            Сообщить(ОписаниеОшибки());
        КонецПопытки;
    Иначе
        Сообщить("Ошибка. Код ошибки"+HTTPОтвет.КодСостояния);      
    КонецЕсли; 
КонецПроцедуры

Функция ПолучитьМакетНаСервере()
    ОтчетОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОтчетОбъект.ПолучитьМакет("Макет");
    Возврат Макет;
КонецФункции

Процедура ВывестиИнформациюОбАМ(СтруктураОтвета)
    Макет = ПолучитьМакетНаСервере();
    ОблШапка = Макет.ПолучитьОбласть("Шапка");
    ОблСтрока = Макет.ПолучитьОбласть("Строка");
    
    
    ОблШапка.Параметры.АМ = СтруктураОтвета.АМ;
    Результат.Вывести(ОблШапка);
    Для Каждого КлючИЗначение Из СтруктураОтвета Цикл
        Если КлючИЗначение.Ключ = "АМ" Тогда 
            Продолжить;
        КонецЕсли; 
        ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,КлючИЗначение);
        Результат.Вывести(ОблСтрока);
    КонецЦикла;     
КонецПроцедуры 

&НаКлиенте
Процедура ПоискПоШК(Команда)
    ПоискПоШКНаСервере(Объект.ШК);
    ЭтаФорма.ТекущийЭлемент = Элементы.ШК;
    Объект.ШК = "";
КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
    ПоискПоШКНаСервере(Объект.ШК); 
 КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    //ПодключитьОбработчикОжидания("УстановитьАктивностьПолюШК",1,Ложь);
КонецПроцедуры


&НаСервере
Процедура ТестПроизводительностиНаСервере()
    МассивСтрок = СтрРазделить(СписокШК,Символы.ПС);
    НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
    Для Каждого ЭлементМассива Из МассивСтрок Цикл
        ПоискПоШКНаСервере(ЭлементМассива);    
    КонецЦикла; 
    КонецЗамера  = ТекущаяУниверсальнаяДатаВМиллисекундах();
    Дельта = КонецЗамера - НачалоЗамера;
    Сообщить("Затрачено времени: "+Дельта);
КонецПроцедуры


&НаКлиенте
Процедура ТестПроизводительности(Команда)
    ТестПроизводительностиНаСервере();
КонецПроцедуры

